# SetFormatOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillScheme..::..SetFormatOptions Method
ColorFillScheme Class See Also
---
Sets the FormatOptions of the scheme.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void SetFormatOptions(
	FormatOptions formatOptions
)
```

Visual Basic
---
```text
Public Sub SetFormatOptions ( _
	formatOptions As FormatOptions _
)
```

Visual C++
---
```text
public:
void SetFormatOptions(
	FormatOptions^ formatOptions
)
```

# ### Parameters
formatOptions
    Type: Autodesk.Revit.DB..::..FormatOptions
# Remarks
This method will set the FormatOptions if the scheme is by range, otherwise do nothing.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ColorFillScheme Class
Autodesk.Revit.DB Namespace